# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dupes'

# Make sure apps get installed in system Applications dir
cask_args appdir: '/Applications'

# Install GNU core utilities (those that come with OS X are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install more recent versions of some OS X tools
brew 'homebrew/dupes/grep'

# Install Binaries
brew 'git'
brew 'node'
brew 'wget'

# Apps
cask '1password'
cask 'adobe-acrobat'
cask 'adobe-illustrator-cc'
cask 'adobe-photoshop-cc'
cask 'adobe-photoshop-lightroom'
cask 'atom'
cask 'dropbox'
cask 'filezilla'
cask 'firefox'
cask 'google-chrome'
cask 'iterm2'
cask 'kaleidoscope'
cask 'postman'
cask 'sketch'
cask 'skype'
cask 'spotify'
cask 'utorrent'
cask 'vlc'

# Fonts
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-droid-sans'
cask 'font-droid-sans-mono'
cask 'font-roboto'
