# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'homebrew/cask-drivers'

# Make sure apps get installed in system Applications dir
cask_args appdir: '/Applications'

# Install GNU core utilities (those that come with OS X are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install more recent versions of some OS X tools
brew 'homebrew/dupes/grep'

# Install Binaries
brew 'git'
brew 'bfg'
brew 'node'
brew 'wget'
brew 'rclone'

# Apps
cask '1password'
cask 'anylist'
cask 'arq'
cask 'atom'
cask 'charles'
cask 'daisydisk'
cask 'discord'
cask 'doxie'
cask 'dropbox'
brew 'ffmpeg'
cask 'filezilla'
cask 'firefox'
cask 'franz'
cask 'gitkraken'
cask 'google-chrome'
cask 'hyper'
cask 'imageoptim'
cask 'iterm2'
cask 'java'
cask 'kaleidoscope'
cask 'mediainfo'
cask 'parallels-desktop'
cask 'postman'
cask 'sketch'
cask 'skype'
cask 'spotify'
cask 'skitch'
cask 'sonos'
cask 'subsmarine'
brew 'svtplay-dl'
cask 'the-unarchiver'
cask 'tunnelblick'
cask 'utorrent'
cask 'visual-studio-code'
cask 'vlc'
cask 'webstorm'
brew 'zsh'
brew 'zsh-syntax-highlighting'

# Fonts
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-droid-sans'
cask 'font-droid-sans-mono'
cask 'font-roboto'
